import sys, os
import numpy as np
import csv
sys.path.append(os.pardir)  # 부모 디렉터리의 파일을 가져올 수 있도록 설정

def read_csv_2(filename):
    list_n = [] # 추가
    list_x = []
    list_t = []
    f = open(filename, 'r', encoding='utf-8')
    rdr = csv.reader(f)
    i = 0
    for line in rdr:
        if i == 0:
            list_head = line  # 헤드를 읽음
        else:
            line_int = list(map(int, line))  # csv를 읽으면 문자로 읽혀지므로 정수로 변환
            list_n.append(line_int[0]) # 추가: 첫번째 칼럼은 순번
            list_x.append(line_int[1:len(line_int) - 1]) # 첫번째 칼럼은 순번이므로 떼고 마지막도 답이므로 뗀다
            list_t.append(line_int[len(line) - 1])  # 마지막 칼럼은 답 태그
        i = 1
    f.close()
    my_h=np.array(list_head)
    my_n = np.array(list_n) #추가
    my_x = np.array(list_x)
    my_t = np.array(list_t)
    return my_h,my_n,my_x, my_t


INPUT=[
        {1:'주체-본부장',2:'주체-사업부장',3:'주체-실장',4:'주체-팀장',5:'주체-그룹장',6:'주체-팀원'}, # 0 BOSS
        {1:'행사-망년신년',2:'행사-승진', 3:'행사-신입전입',4:'행사-환송',5:'행사-정기',6:'행사-비정기'}, #1 EVENT
        {1:'인원-대_10명이상',2:'인원-중_6~9명', 3:'인원-소_0~5명'},#2 SCALE
        {1:'연령-고)과차부장50%이상',2:'연령-중)과차부장50%미만', 3:'연령-저)사원대리50%이상'}, #3 AGE
        {1: '참가자-여성', 2: '참가자-여성과남성', 3: '참가자-남성'} , #4 GENDER
        {1:'계절-봄',2:'계절-여름',3:'계절-가을',4:'계절-겨울'}, #5 SEASON
        {1:'날씨-맑음',2:'날씨-흐림',3:'날씨-비',4:'날씨-눈'}, #6 WEATHER
        {1:'온도-고', 2: '온도-중', 3: '온도-저'}  # 7 TEMP
        ]
OUTPUT1=[ {1:'회사주변',2:'청계산',3:'양재',4:'사당',5:'강남',6:'의왕',7:'인덕원',8:'수원',9:'기타'} ]# Area
OUTPUT2=[ {1:'룸의자식',2:'룸방바닥',3:'개방의자식',4:'개방방바닥'} ]# Type
OUTPUT3=[ {1:'한식',2:'중식',3:'일식',4:'퓨전/까페',5:'고기집(구이)',6:'횟집',7:'해산물',8:'뷔페',9:'국물요리',10:'기타',11:"삭제"} ]# FOOD

#==질문=======================================================================================
#        주체6, 이벤트6,  인원3,  연령3,  성별3,  계절4,  날씨4,  온도3
Q =     [   6,       2,      3,      2,      3,      1,      1,      2 ]
#=============================================================================================
#==수정=======================================================================================
#    주체6, 이벤트6,  인원3,  연령3,  성별3,  계절4,  날씨4,  온도3
Q_ =   [   1,       1,      1,      1,      1,      1,      1,      2 ]
#     장소, 형태, 음식
A =    [ 1,    2,    3 ]
# 수정방법은
# Q_를 찾으면 교체, 못찾으면 추가
#=============================================================================================

# =================== Main =================
my_h,my_n,my_x, my_t = read_csv_2("dataset/Food/output_full.csv")
print(my_x[0])
q=np.array(Q_)
print(q)

for i in range(0,1942):
    print(i,my_x[i])
   # if np.all(my_x[i]==q) :
   #      print("y")


